using System.Collections;
using System.Collections.Generic;
using UnityEngine;

public class ToDoList
{
     /**
     * 1. дописать выключение кнопки зданий и информации о ней, если покидаем улицу (пока что корявый вариант)
     * 2. дописать создане новой игры в дбворке для онлайна и разных городов
     * 3. написать переключение между камерами на кнопочку + смена режима между орто и перспективой
     * 4. Дописать методы в  GameCanvas, когда появятся здания и допишутся методы, которые нужно здесь вызвать (торговля, покупки, здания и прочее)
     * 5. прописать сохранение и загрузку путей в SaveLoad(?) и Ways
     * 6. сделать удаление сохраненных игр
     * 7. сделать регулировку громкости
     * 8. докомментировать MouseController
     * 9. сделать отображение списка улиц только нашего игрока
     * 10. прописать для ботов мухлёж и в целом более продивнутый интеллект
     * 11. торговля между игроками
     * 12. прописать фризы при открытии меню паузы
     * 13. прописать на какие улицы можно сходить за раз при виде от первого лица и от третьего
     * 14. добавить проверку на запрет прохождения одной улицы дважды за один ход
     */
}