using System.Collections;
using System.Collections.Generic;
using UnityEngine;

public class ToDoList
{
     /**
     * 1. Доделать сейв в дбворке
     * 2. Доделать сейв как новый файл в дбворке
     * 3. Решить проблему с уничтожением камеры при возврате в главное меню
     * 4. дописать выключение кнопки зданий и информации о ней, если покидаем улицу (пока что корявый вариант)
     * 5. дописать создане новой игры в дбворке для онлайна и разных городов
     * 6. написать переключение между камерами
     * 7. Дописать методы в  GameCanvas, когда появятся здания и допишутся методы, которые нужно здесь вызвать (торговля, покупки, здания и прочее)
     * 8. прописать сохранение и загрузку путей в SaveLoad(?) и Ways
     * 9. сделать удаление сохраненных игр
     * 10. сделать регулировку громкости
     * 11. докомментировать MouseController
     * 12. сделать отображение списка улиц только нашего игрока
     * 13. переписать сохранение дб в другую папку
     * 14. дополнить cathedPlayers в gameController
     */
}