using System.Collections;
using System.Collections.Generic;
using UnityEngine;

public class ToDoList
{
     /**
     * 1. Доделать сейв в дбворке
     * 2. Доделать сейв как новый файл в дбворке
     * 3. Решить проблему с уничтожением камеры при возврате в главное меню
     * 4. дописать в дбворке подгрузку зданий для определенной улицы
     * 5. дописать выключение кнопки зданий, если покидаем улицу
     * 6. выяснит в дбворке по поводу старта
     * 7. дописать создане новой игры в дбворке для онлайна и разных городов
     * 8. написать переключение между камерами
     * 9. Дописать методы в  GameCanvas, когда появятся здания и допишутся методы, которые нужно здесь вызвать (торговля, покупки, здания и прочее)
     * 10. прописать сохранение и загрузку путей в SaveLoad(?) и Ways
     * 11. сделать удаление сохраненных игр
     * 12. сделать регулировку громкости
     * 13. Выяснить по поводу якобы неиспользуемых переменных в плеере
     * 14. выяснить по поводу метода GetPlayers  в плеере
     * 15. Выяснить по поводу двух методов, возвращающих положение игрока на карте в плеере GetDestination и Destination
     * 16. Выяснить по поводу GetData в плеере
     * 17. докомментировать MouseController
     * 18. написать стоимость покупки части улицы
     * 19. дописать StepOnMe в StreetPath
     * 20. Выяснить по поводу TakeData в StreetPath
     * 21. 
     */
}