using System.Collections;
using System.Collections.Generic;
using UnityEngine;

public class ToDoList
{
     /**
     * 1. Решить проблему с уничтожением камеры при возврате в главное меню
     * 2. дописать выключение кнопки зданий и информации о ней, если покидаем улицу (пока что корявый вариант)
     * 3. дописать создане новой игры в дбворке для онлайна и разных городов
     * 4. написать переключение между камерами на кнопочку
     * 5. Дописать методы в  GameCanvas, когда появятся здания и допишутся методы, которые нужно здесь вызвать (торговля, покупки, здания и прочее)
     * 6. прописать сохранение и загрузку путей в SaveLoad(?) и Ways
     * 7. сделать удаление сохраненных игр
     * 8. сделать регулировку громкости
     * 9. докомментировать MouseController
     * 10. сделать отображение списка улиц только нашего игрока
     * 11. прописать для ботов мухлёж и в целом более продивнутый интеллект
     * 12. решить проблему с поворотом направо в билде
     * 13. перемещение верхней камеры
     * 14. торговля между игроками
     * 15. 
     */
}